<?php
$meta = array(
  'description' => '前職で「CLO（最高教育責任者）」の肩書をつけてもらったり事務センターで中間管理職をしていたり楽器の講師をしていたりと何かと「人に何かを教える」という事を仕事にする事が多いです。',
  'keywords' => '教育,組織,新卒',
  'title' =>  '教育と学習に対する自戒',
  'date' => '2016-04-29'
);
?>
<?php include('src/common/_head.php'); ?>
<div class="row">
  <div class="col-xs-12">
    <div class="panel panel-default">
      <div class="panel-heading">
        <h3 class="panel-title text-center"><?php echo $meta['title']; ?></h3>
      </div>
      <div class="panel-body">
        <p>前職で「CLO（最高教育責任者）」の肩書をつけてもらったり</p>
        <p>事務センターで中間管理職をしていたり</p>
        <p>楽器の講師をしていたりと</p>
        <p>何かと「人に何かを教える」という事を仕事にする事が多いです。</p>
        <p>現職でも新卒で入ってきたエンジニアのOJT受け入れのメンターとしてやって欲しいという打診を受けたり</p>
        <p>チームの若いリーダーを見守る良き兄貴分であってほしいとか</p>
        <p>色々な事を期待していただける事に感謝していますし</p>
        <p>やはり期待には応えていきたいので</p>
        <p>しっかりとチームと人を育てていければなと思っています。</p>
        <br><br>
        <p>さすがに春先なので</p>
        <p>教育に関する記事や</p>
        <p>今後のキャリア形成の考え方に関する</p>
        <p>いわゆる新卒向けコンテンツが目立つのですが</p>
        <p>教育は教育をする側と受ける側の心の準備や取り組み方</p>
        <p>進め方で大きく成長の仕方が変わってくるものだと思っています。</p>
        <p>上手に教育を進めていくためには</p>
        <p>教育に対するスキルを高めていく必要がありますし</p>
        <p>もっと言えば「人と相対する」というスキルが必要になってきます。</p>
        <br><br>
        <p>どうしても初めて部署を受け持ったり</p>
        <p>あるいは部下や後輩を持った時は緊張してしまうものですし</p>
        <p>気合いが入り過ぎてうまく事が進まないという葛藤も多々あるでしょう。</p>
        <p>ひとつ心構えとして気を付けなくてはいけないのは</p>
        <p>教育を受ける側が成長するのは当然のことで</p>
        <p>それ以上に教育をする側の成長を促す部分が大きいということです。</p>
        <p>もっと言ってしまえば</p>
        <p>「人が人に何かを教える事が出来る」と思う事自体がおこがましい</p>
        <p>とすら思っています。</p>
        <p>伝える事は出来ても教える事は出来ないと思うのです。</p>
        <p>伝えた言葉や態度の中で</p>
        <p>教育を受けている側が「学習」をし「習得」をしていく</p>
        <p>という過程を「教育」や「指導」と呼んでいるだけだと思うのです。</p>
        <br><br>
        <p>人の感情は不思議なもので</p>
        <p>「何かをしてあげた」経験よりも「何かをしてもらった」経験の方が</p>
        <p>ずっと少なく感じるらしいです。</p>
        <p><a href="http://www.gakushuin.ac.jp/univ/let/top/publication/res_pdf_61/010.pdf" target="_blank">「感謝を感じる経験と感謝される　経験における感情」より</a></p>
        <p>これは教育をする側が「こんなに教育をしているのに」という感情が</p>
        <p>教育を受ける側には全部は届かないことを意味しています。</p>
        <p>つまり「行った事はすべて伝わっている」という前提で話を進めていくと</p>
        <p>それは失敗する可能性が高いということです。</p>
        <br><br>
        <p>そして対象にしている人は</p>
        <p>ほぼ間違いなく自分とは別の人生を歩んできたひとりの人間なのです。</p>
        <p>業務の上では確かに教育者の方が優れた部分が多いかもしれません。</p>
        <p>より長く生きている事も多いと思います。</p>
        <p>それでも20年以上の自身が知らない人生の歩み方をしている人と</p>
        <p>一緒に今後の働き方を考えるという機会が得られたのですから</p>
        <p>それは業務の仕方を教えるだけではとてももったいない事だと思うのです。</p>
        <p>教育者の知らない20年を</p>
        <p>是非教育を受ける側から学び取れれば</p>
        <p>それは大きな財産になります。</p>
        <br><br>
        <p>自身と違う考え方に触れる</p>
        <p>という事も大きな刺激になります。</p>
        <p>もしかすると良くない考え方を推し進めようとしているかもしれません。</p>
        <p>しかし</p>
        <p>その考えに行きついた経緯を紐解くことは</p>
        <p>結論の良し悪しに関わらず</p>
        <p>とても多くの発見を得る事が出来ると感じています。</p>
        <p>多くのビジネスHowToの本や記事で</p>
        <p>「教育者は生徒から学ばなければならない」と書かれていますが</p>
        <p>それは年齢や経験に関わらず</p>
        <p>人から何かを学び取る姿勢があるかどうかということ</p>
        <p>そして一緒に働いている人を</p>
        <p>年齢や経験に関わらず尊敬して尊重して接することが出来ているか</p>
        <p>という自戒にも繋がってきます。</p>
        <br><br>
        <p>企業は組織で目標に向かっていかなくてはなりませんし</p>
        <p>個人事業主も多くは何かしらのチームでビジネスを推進していく事が多いです。</p>
        <p>その中で</p>
        <p>教育者になった途端に</p>
        <p>後輩が出来たり部下を持つようになった途端に</p>
        <p>人と接する</p>
        <p>という事に驕りが出ていないか</p>
        <p>という事をよく考えきをつけなくてはいけません。</p>
        <p>人は簡単に傲慢になれますし</p>
        <p>傲慢になった人は成長の速度が極端に落ちていきます。</p>
        <p>第一線で働くビジネスパーソンほど腰が低く謙虚であるという話は</p>
        <p>そういった日々の訓練や心の持ちようによって生み出される</p>
        <p>ひとつのスキルなのかな</p>
        <p>と最近思うわけです。</p>
        <br><br>
        <p>自分自身も日々自らを客観的に見るように努め</p>
        <p>戒めを持って良き成長をしていければなと思っています。</p>
      </div>
    </div>
  </div>
</div>
<?php include('src/common/_foot.php'); ?>
