<?php
$meta = array(
  'description' => '以前からチームで仕事をする時に「筋肉質な組織を作りたい」「少数精鋭でやりたい」という話と「属人化を排除したい」「業務フローをマニュアル化していきたい」という話が度々話されていると感じています。',
  'keywords' => 'チームビルド,筋肉質な組織,マニュアル化',
  'title' =>  '「筋肉質な組織」と「属人化の排除」が難しいという話',
  'date' => '2016-04-24'
);
?>
<?php include('src/common/_head.php'); ?>
<div class="row">
  <div class="col-xs-12">
    <div class="panel panel-default">
      <div class="panel-heading">
        <h3 class="panel-title text-center"><?php echo $meta['title']; ?></h3>
      </div>
      <div class="panel-body">
        <p>以前からチームで仕事をする時に</p>
        <p>「筋肉質な組織を作りたい」「少数精鋭でやりたい」という話と</p>
        <p>「属人化を排除したい」「業務フローをマニュアル化していきたい」という話が</p>
        <p>度々話されていると感じています。</p>
        <p>しかしこのふたつの話は基本的に両立しないと考えています。</p>
        <p>「少数精鋭の筋肉質な組織」は属人化の賜物であり</p>
        <p>属人化を排除しマニュアル化された業務フローを採用しているチームは少数精鋭にはなりえないからです。</p>
        <br><br>
        <p>以前一緒に仕事をしていたマネージャーが</p>
        <p>「両立しないふたつの主張が行ったり来たりするのが組織の常だ」</p>
        <p>みたいな事を言っていた気がします。</p>
        <p>例えば筋肉質な少数精鋭チームは</p>
        <p>その分だけ個々人の負荷が高く</p>
        <p>効率を良くしていくために属人化が避けられません。</p>
        <p>誰かが退職したり転籍する時に引継ぎが大変だったり</p>
        <p>場合によっては引き継ぎ先が無いという問題が発生します。</p>
        <p>問題が発生すれば当然解決の方法を模索し</p>
        <p>「属人化を避けよう」という話になってきます。</p>
        <p>しかし属人化を避けマニュアル化された業務フローのチームは</p>
        <p>それぞれの業務を「誰でも出来る作業」に落とし込んだ状態ですので</p>
        <p>その分だけ人数が必要であったり</p>
        <p>チーム全員がフロー全体を把握していなかったりします。</p>
        <p>細かい綻びが積み重なって大きな事故が起きたり</p>
        <p>あるいはたくさんのフローを通さなくてはいけないことでスピードが下がったりします。</p>
        <p>「もっと効率の良いチームを作ろう」として</p>
        <p>個々人のスキルアップを目指し</p>
        <p>結果として属人化の波が来るのです。</p>
        <br><br>
        <p>これらをうまくコントロールする術は無いかなと考えた時に</p>
        <p>「チームを小さくする」ということと</p>
        <p>「チームリーダーの権限を大きくする」という解決策があるかなと思っています。</p>
        <p>チームを小さくすることで</p>
        <p>チームがやらなくてはいけない業務を小分けにして</p>
        <p>チーム単位で見た時に「属人化」を防ぎます。</p>
        <p>必要な業務であればチーム自体がなくなる事はありませんし</p>
        <p>業務範囲を小さくする事で業務譲渡もスムーズにいきます。</p>
        <p>リーダーの権限を大きくする事は</p>
        <p>チームとして筋肉質である事に繋がります。</p>
        <p>他のチームとの効率の良いフローを模索し続けなければならず</p>
        <p>その分だけリーダーがやらなくてはいけない責任は大きくなりますが</p>
        <p>それが可能なリーダーを抜擢するべきですし</p>
        <p>そういうリーダーを育てていくべきです。</p>
        <p>そしてリーダーを育てることもチームを適切に分割することも</p>
        <p>さらに上の事業部長や役員が行わなくてはいけないので</p>
        <p>良き編成に出来るかどうかは</p>
        <p>売り上げや利益に対して最終的な責任がある層に委ねられていきます。</p>
        <br><br>
        <p>これを実現していくことの難しさは</p>
        <p>チーム編成を行っていく人が適切なスキルを付けられるかどうかの部分と</p>
        <p>編成したチームに適切なリーダーを育ててあてがっていけるかどうかにかかっているということです。</p>
        <p>多くの経営者は人を育てる事がとても苦手です。</p>
        <p>これは割合の問題で</p>
        <p>事業を推進することに長けた人が</p>
        <p>必ずしも人を育ててチームを育てることに長けた人ではないということです。</p>
        <p>大企業も中小企業も</p>
        <p>多くの会社、多くのチームを見てきましたが</p>
        <p>双方が両立している人を見たことはほぼありません。</p>
        <p>双方が両立している会社やチームは</p>
        <p>事業推進の責任者とチーム編成や人材育成の責任者を分けている事がほとんどです。</p>
        <p>「外向きのマネジメント」と「内向きのマネジメント」という風に呼んでいますが</p>
        <p>大企業を目指しながら中小企業のままで収まってしまう企業は</p>
        <p>ここのバランスがうまくとれていないと感じる事が非常に多いです。</p>
        <p>特に企業として存続している場合は</p>
        <p>外向きのマネジメントがうまくいっているから売り上げはある程度確保出来ているが</p>
        <p>チームとして強くないので伸びしろを見いだせずに停滞している事がとても多いです。</p>
        <br><br>
        <p>コンサルタントでなければ経営者でもないですが</p>
        <p>良き事業を夢見て良きビジネスパートナーに恵まれ</p>
        <p>それでも伸び悩んでいる企業を見ると</p>
        <p>「属人化した組織」と「マニュアル化された組織」の良い点を理解して</p>
        <p>うまくバランスを取っていけば</p>
        <p>もう少し楽に事業展開を出来るのになと思う事は多々あります。</p>
        <p>もちろん人件費の問題や直近の決算の問題もあるので</p>
        <p>人材配置に対して大ナタを振るうのは怖いと思います。</p>
        <p>しかしそこに注力出来ない企業は間違いなく伸び悩んでしまいますし</p>
        <p>従業員から愛されない会社になっていってしまいます。</p>
        <p>十分な給料と張り合いのある仕事をチームのメンバーに渡していくために</p>
        <p>良きチームビルドを行っていき</p>
        <p>チームみんなで事業を大きくしていく事が</p>
        <p>良い会社として大きくなっていく事に繋がるのかなと</p>
        <p>そんな事を考えている今年の春です。</p>
      </div>
    </div>
  </div>
</div>
<?php include('src/common/_foot.php'); ?>
