<?php
$meta = array(
  'description' => 'エンジニアという職業は何かと時間に追われる印象があります。コードを書く、システムを作る、そんなことが何かと時間がかかるのです。',
  'keywords' => 'エンジニア,魔法使い,プロジェクト管理',
  'title' =>  'それでも僕は魔法使いになりたい',
  'date' => '2016-03-07'
);
?>
<?php include('src/common/_head.php'); ?>
<div class="row">
  <div class="col-xs-12">
    <div class="panel panel-default">
      <div class="panel-heading">
        <h3 class="panel-title text-center"><?php echo $meta['title']; ?></h3>
      </div>
      <div class="panel-body">
        <p><strong>「魔法使いになりたい」って言ったら笑われました</strong></p>
        <p>エンジニアという職業は何かと時間に追われる印象があります。</p>
        <p>コードを書く、システムを作る</p>
        <p>そんなことが何かと時間がかかるのです。</p>
        <p>また、作業に時間がかかるというだけでなく</p>
        <p>「手戻り」が発生しやすい業務状況があります。</p>
        <p>システムを要求する側の要望が変わっていくケース</p>
        <p>システムを作る側が新しい壁を発掘してしまうケース</p>
        <p>予算が、時間が、</p>
        <p>実に様々な要因で手戻りが発生します。</p>
        <p>それを全部ひっくり返す確かな手段は無いのですが</p>
        <p>もしあるとすれば「魔法使い」になることかなと</p>
        <p>そんな事を考えます。</p>
        <br><br>
        <p>具体的に魔法使いとは</p>
        <p>1.システムを作るのが速い</p>
        <p>2.システムの穴を見つけるのが速い</p>
        <p>3.ビジネス要件のキャッチアップが速い</p>
        <p>みたいなことかなと思います。</p>
        <p>システムを知らない人の中には</p>
        <p>エンジニアという職業の人はみんな魔法使いで</p>
        <p>システムは魔法だと思っている人もいます。</p>
        <p>もちろんそんなことはありませんが</p>
        <p>エンジニアはよく「魔法使い」である事を要求され</p>
        <p>私自身はその要求に最大限応える方法を模索し</p>
        <p>最終的には「魔法使いになりたい」という</p>
        <p>見当はずれとも言い難い夢を見るようになりました。</p>
        <p>せっかくなので夢の検討をしてみましょうか。</p>
        <br><br>
        <p><strong>1.システムを作るのが速い</strong></p>
        <p>システムを作る上でコーディングの時間は</p>
        <p>実質ほぼ無いと思っています。</p>
        <p>コーディングのスピードは</p>
        <p>人によってそんなに変わるものでは無いし</p>
        <p>タイピング速度も劇的に変化するものでもないと思います。</p>
        <p>ましてや最近は開発ツールもとても発達していて</p>
        <p>そこまで差が出ないと思うのです。</p>
        <p>では差が出るのはどこでしょうか。</p>
        <p>コードを書く前の要件定義や設計</p>
        <p>コードを書いた後のテストやリリース</p>
        <p>とくに前段階については</p>
        <p>2番の「システムの穴」を見つける速さに繋がります。</p>
        <p>スムーズな要件定義と良き設計が</p>
        <p>魔法使いになる最大の条件だと言っても過言ではありません。</p>
        <br><br>
        <p><strong>2.システムの穴を見つけるのが速い</strong></p>
        <p>「経験がものを言う」と言ってしまえば</p>
        <p>まあそれまでなのですが</p>
        <p>新しいものを使うにはハードルが高く</p>
        <p>古いものを使い続けるにはコストが高い世の中です。</p>
        <p>枯れたソースと</p>
        <p>新しい物の共存をさせ</p>
        <p>良い状態でシステムを保つには</p>
        <p>運用や追加開発で出てきてしまう「綻び」をいち早く察知する必要があります。</p>
        <p>そういうものを察知する方法として</p>
        <p>「テスト駆動開発」なんてのも提唱されていますが</p>
        <p>未だに「導入コストが高い」という理由で</p>
        <p>導入を見送られがちだと思います。</p>
        <p>テストコードが正しいかどうかを担保する事は大変難しいですが</p>
        <p>正しいテストコードに直していく事は出来るのではないかと思うのと</p>
        <p>正しいテストが行われているかの部分を属人化してしまうよりは</p>
        <p>コードという共有の資産で担保した方が現実的なのかなと。</p>
        <p>もちろん求められている「魔法使い」には</p>
        <p>「自動テスト」が魔法の杖のように必要なんだろうなという意味です。</p>
        <p>ぶっちゃけ苦手なんですが・・・</p>
        <br><br>
        <p><strong>3.ビジネス要件のキャッチアップが速い</strong></p>
        <p>これは正直ビジネスを推進している人たちと</p>
        <p>どうコミュニケーションを取っているかの問題だと思います。</p>
        <p>ビジネスサイド、エンジニアサイドという分け方は嫌いですが</p>
        <p>それぞれ特化した知識やスキルの上に成り立っている仕事だと考えれば</p>
        <p>ビジネスを推進する人にもエンジニアの知識は多少必要ですし</p>
        <p>エンジニアとして働いている人にもビジネスの知識が必要になります。</p>
        <p>そこには「ビジネススキル」として標準化出来る内容もあると思いますが</p>
        <p>業界特化の知識もあると思うのです。</p>
        <p>特定業界でしか働いたことの無い人は</p>
        <p>その分視野が狭まっている事も多いですし</p>
        <p>逆に多種多様な業界に携わってきた人は</p>
        <p>特定業種のトレンドを追い切れていない可能性もあります。</p>
        <p>何が正解というよりは、チームとしてあるべき知識の共有方法を考えるべきなのかなと</p>
        <p>そんな事を思うのです。</p>
        <br><br>
        <p>色々つらつら書いてはみましたが</p>
        <p>結局は「魔法使い」として認められるかどうかよりも</p>
        <p>チームにとって良きエンジニアでいられるかどうか</p>
        <p>みたいなところが大切なのかなと思ったので</p>
        <p>やっぱり僕は魔法使いになりたいです。</p>
      </div>
    </div>
  </div>
</div>
<?php include('src/common/_foot.php'); ?>
