<?php
$meta = array(
  'description' => '周囲の人に対して批判的な人っているじゃないですか。自身の態度をきちんと表現できるという意味では素晴らしいのですが自身の思想を他人に強要したり…',
  'keywords' => '自由,権利,人間関係',
  'title' =>  '受け入れるということでストレスから解放されると思っていました。',
  'date' => '2016-03-09'
);
?>
<?php include('src/common/_head.php'); ?>
<div class="row">
  <div class="col-xs-12">
    <div class="panel panel-default">
      <div class="panel-heading">
        <h3 class="panel-title text-center"><?php echo $meta['title']; ?></h3>
      </div>
      <div class="panel-body">
        <p><strong>フランスの哲学者の言葉だと思ってたんですよ</strong></p>
        <p>周囲の人に対して批判的な人っているじゃないですか</p>
        <p>自身の態度をきちんと表現できるという意味では素晴らしいのですが</p>
        <p>自身の思想を他人に強要したり</p>
        <p>あるいは世界の常識だと思っている人が非常に苦手です</p>
        <p>母から「我が家は無宗教だ」と言われて育ってきましたが</p>
        <p>基本的には「汝の敵を愛せよ」の</p>
        <p>キリスト教的な道徳観を教えられる事が多かったように感じます</p>
        <p>幼少期に刷り込まれた道徳観はそうそう変わるものではないので</p>
        <p>先の「批判的な人」も大抵は</p>
        <p>「嫌い」と言うより「苦手」止まりな事が多いですし</p>
        <p>場合によっては「可愛いなｗ」と思う事すらあります</p>
        <p>ただあまりに排他的な態度を取り続ける人には抱く感情は常に一緒で</p>
        <p>「私はあなたの意見には反対だ、だがあなたがそれを主張する権利は命をかけて守る」</p>
        <p>みたいな感じです</p>
        <p>実際は命をかけてまで守る気はないですけどねｗ</p>
        <br><br>
        <p>先の言葉はフランスの哲学者<a href="https://ja.wikipedia.org/wiki/%E3%83%B4%E3%82%A9%E3%83%AB%E3%83%86%E3%83%BC%E3%83%AB" target="_blank">ヴォルテールさん</a>の言葉として紹介されることが多いですが</p>
        <p>実際はヴォルテールさんの事を書いた「ヴォルテールの友人」という書籍の一説らしいです</p>
        <p>しかもそこに「～～とは今の彼の態度だった」みたいな書き方がされており</p>
        <p>実際の発言ではなさそうなんですよね</p>
        <p>出自がどうあれこの言葉はとても好きです</p>
        <p>どこかで聞きかじったのですが</p>
        <p>ついさっきまで誰のどんな発言だったのか思い出せなかったので</p>
        <p>忘備録として・・・</p>
      </div>
    </div>
  </div>
</div>
<?php include('src/common/_foot.php'); ?>
