<?php
$meta = array(
  'description' => '当時は9階建てのビルの最上階で仕事をしていました。免震構造だったせいかゆっくりゆっくりと大きな揺れを感じ…',
  'keywords' => '3・11,東日本大震災',
  'title' =>  '5年',
  'date' => '2016-03-11'
);
?>
<?php include('src/common/_head.php'); ?>
<div class="row">
  <div class="col-xs-12">
    <div class="panel panel-default">
      <div class="panel-heading">
        <h3 class="panel-title text-center"><?php echo $meta['title']; ?></h3>
      </div>
      <div class="panel-body">
        <p><strong>あの日…</strong></p>
        <p>当時は9階建てのビルの最上階で仕事をしていました</p>
        <p>免震構造だったせいか</p>
        <p>ゆっくりゆっくりと大きな揺れを感じ</p>
        <p>社員全員で非常階段で降りました</p>
        <p>家族に連絡を取ろうにも電話はつながらず</p>
        <p>メールは遅延しまくり</p>
        <p>ビルの下で一時たむろしていましたが</p>
        <p>上長からの指示で避難場所へ移動しました</p>
        <br><br>
        <p>それまで遠足の様な雰囲気だったのですが</p>
        <p>避難所で流れるニュース映像で</p>
        <p>被害の甚大さを知りました</p>
        <p>阪神淡路大震災の時も</p>
        <p>米国同時多発テロの時も</p>
        <p>ニュース映像は現実感が無く</p>
        <p>遠い土地のお話でした</p>
        <p>東日本大震災も</p>
        <p>第一報は遠いお話だったのです</p>
        <br><br>
        <p>しばし辛い映像を見た後</p>
        <p>それぞれ同じ方向同士でまとまって帰りました</p>
        <p>都内は歩く人飲む人</p>
        <p>そして多くのタクシーとレンタカーでごった返していました</p>
        <p>山手線圏内を出るまではとにかく</p>
        <p>人の波でした</p>
        <p>中にはまだ実情を知らない人も多かったと思いますし</p>
        <p>私もまだ本当の全容を知りませんでした</p>
        <br><br>
        <p>テレビのニュースに</p>
        <p>友人たちの情報</p>
        <p>東京でも多くの機関が麻痺し</p>
        <p>不安が日々を包みました</p>
        <br><br>
        <p>なんかね</p>
        <p>毎年思い出してみても</p>
        <p>やっぱり辛いんですよね</p>
        <p>日本は地震大国ですし</p>
        <p>日本で過ごしている限りは</p>
        <p>地震とは切っても切れない関係なんだとわかっていても</p>
        <p>多くの方が亡くなり</p>
        <p>多くの方が未だに故郷に帰れないこと</p>
        <p>価値観がぐるっと変わってしまったこと</p>
        <p>やっぱりつらいです</p>
        <p>難しい話はたくさんあるのですが</p>
        <p>あの日を境に知った大切なことを覚えているために</p>
        <p>毎年ちゃんと思い出せればと思います</p>
      </div>
    </div>
  </div>
</div>
<?php include('src/common/_foot.php'); ?>
